IDEA StatiCa Open Model
BeamData.IsNegativeObject Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Is negative object
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public bool IsNegativeObject { get; set; }
Public Property IsNegativeObject As Boolean
	Get
	Set
public:
property bool IsNegativeObject {
	bool get ();
	void set (bool value);
}
Property Value
Type: Boolean
See Also
Reference
BeamData Class
IdeaRS.OpenModel.Connection Namespace